{
  "backend/main.mo": "Main actor implementing Pokemon game backend with functions for managing Pokecoin balances, Pokemon collections (with shiny/female tracking), payouts, and match results using Map-based storage per Principal.",
  "backend/migration.mo": "Migration module defining type aliases for Pokemon, Payout, and MatchResult, with a pass-through migration function that preserves existing actor state.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: match-three game mechanics, Pokecoin rewards, shiny Pokemon discovery, payout calculation, and game tab navigation.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend TypeScript/React components and hooks including game logic, UI components, and backend integration queries.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light/dark theme variables including Pokemon-themed colors (pokecoin-gold, shiny-pink, payout-green, pokemon-blue/red).",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Pokecoin App.",
  "frontend/src/App.tsx": "Main React application component with Internet Identity authentication, four-tab interface (Game, Pokecoins, Shiny Pokemon, Payouts), and themed welcome screen for unauthenticated users.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, current year, and Caffeine.ai attribution link with UTM tracking parameters.",
  "frontend/src/components/GameBoard.tsx": "GameBoard component rendering an 8x8 grid of GameTile components with background image, handling tile selection and click events while managing processing state.",
  "frontend/src/components/GamePayoutSummary.tsx": "Card component displaying payout conversion metrics including total balance, dollar value, progress toward next $1 payout threshold (1000 Pokecoins), and conversion rate information.",
  "frontend/src/components/GameScoreDisplay.tsx": "Displays game statistics (score, moves, pokecoins earned, combo) in a grid of four styled cards with icons. Calculates total balance by adding earned pokecoins to current balance.",
  "frontend/src/components/GameTile.tsx": "Renders individual game tiles with Pokemon names, colors, and shiny indicators. Handles tile selection, matching animations, and disabled states with visual feedback.",
  "frontend/src/components/Header.tsx": "Sticky header component displaying app title with gradient styling and Internet Identity login/logout button. Shows authentication status and handles login state transitions.",
  "frontend/src/components/MatchThreeGame.tsx": "Main match-three game component orchestrating game board, scoring, and backend integration. Handles game end logic, records match results with pokecoins and shiny discoveries, and displays game instructions in a dialog.",
  "frontend/src/components/PayoutManager.tsx": "Manages Google Play payout tracking with form to log payouts by amount, currency, and date. Displays total earnings aggregated by currency and historical payout list.",
  "frontend/src/components/PokecoinTracker.tsx": "Tracks and updates Pokecoin balance with a form input and displays current balance. Shows loading states and provides visual feedback with toast notifications.",
  "frontend/src/components/ShinyDiscoveryNotification.tsx": "Animated notification overlay that appears when a shiny Pokemon is discovered. Auto-dismisses after 2.8 seconds with zoom-in animation and sparkle effects.",
  "frontend/src/components/ShinyFemaleTracker.tsx": "Manages shiny female Pokemon collection with add/search functionality. Displays collection count and searchable list of logged Pokemon with badge indicators.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGameLogic.ts": "Implements match-3 game logic with an 8x8 board, tile matching, gravity, shiny Pokemon spawning, combo system, and score tracking for a Pokemon-themed puzzle game.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend API calls including Pokecoin balance, Pokemon logging/searching, payout management, and match result recording with automatic cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom Pokemon-themed color variables (pokecoin-gold, shiny-pink, payout-green) and component styles for cards with gradients and hover effects in light/dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with Pokemon-themed colors (pokecoin-gold, shiny-pink, payout-green, pokemon-blue/red), custom animations (accordion, shimmer), and OKLCH color system integration.",
  "project_state.json": "Project state file defining a Pokemon Go companion app with match-three tile game mechanics, Pokecoin tracking, shiny female Pokemon discovery, and Google Play payout integration. Contains 8 existing features covering balance tracking, Pokemon collection, gameplay mechanics, and themed UI design."
}